Tekla Open API Reference for Tekla Structures 2025
ModuleManager Properties
The ModuleManager type exposes the following members.
Properties
Name | Description
AnalysisAndDesign
 Indicates whether the Analysis and Design management is enabled.
CIPModeling
 Indicates whether the CIP modeling is enabled.
ConcreteDetailing
 Indicates whether the concrete detailing is enabled.
Configuration
 The currently running configuration of Tekla Structures.
LoadModeling
 Indicates whether the load modeling is enabled.
MultimaterialModeling
 Indicates whether the multimaterial modeling is enabled.
RebarModeling
 Indicates whether the rebar modeling is enabled.
SteelDetailing
 Indicates whether the steel detailing is enabled.
TaskManagement
 Indicates whether the task management is enabled.
Top
See Also
Reference
ModuleManager Class
Tekla.Structures Namespace